#include<iostream>
using namespace std;
int main()
{
    int m,j,countm(0);//countm是素数的个数，从0开始，每次增加1，得到1,2,3等素数的个数
    for (m = 2; m <= 100; m++)//m是100以内的数，从2开始，到100结束
    {
        for (j = 2; j <= m - 1; j++)//j是2到m-1之间的数，从2开始，到m-1结束
        {
            if (m % j == 0)//如果m能被j整除，那么m就不是素数
            break;//跳出循环
        }
        if (j == m)//如果m不能被2到它本身-1之间的任何一个数整除，那么m就是素数
        {
            cout << m << '\t';//输出素数m
            countm++;//countm增加1，得到下一个素数的个数
            if (countm % 8 == 0)//如果countm是8的倍数，那么就换行输出
            {
                cout << endl;
            }
        }
    }
    return 0;
}

//这里是怎么表示素数的？
//素数就是只能被1和它本身整除的数，例如2,3,5,7,11,13,17,19等
//所以，我们可以通过判断一个数是否能被2到它本身-1之间的数整除来判断它是否是素数
//如果这个数能被2到它本身-1之间的任何一个数整除，那么它就不是素数
//如果这个数不能被2到它本身-1之间的任何一个数整除，那么它就是素数
//所以，我们可以通过一个循环来判断一个数是否是素数，如果这个数能被2到它本身-1之间的任何一个数整除，那么就跳出循环，否则就输出这个数
//最后，我们还需要判断输出的素数是否是8个一行的，如果是，那么就换行输出
//所以，这个程序的功能就是输出100以内的所有素数，并且每行输出8个素数

//本题的时间复杂度是O(n^2)，空间复杂度是O(1)

//若要提高运行效率，只要在2~sqrt(m)找不到m的因子，则m必为素数
//因为若m不是素数，则m至少有一个因子f，且f<=sqrt(m)，所以只需在2~sqrt(m)之间查找即可
//时间复杂度可以降低到O(n^1.5)，空间复杂度是O(1)

//本题使用break，当m能被2到它本身-1之间的任何一个数整除时，跳出循环
//能否使用continue？
//不能，因为continue只能用于循环语句中，而break可以用于循环语句和switch语句中