#include<iostream>
using namespace std;
int main()
{
    int n;
    cin >> n;
    long long f[50];//为什么用数组，因为n最大为50，所以用数组存储f[i]，避免重复计算
    f[1] = 1;//即f(1) = 1，与数学上的函数定义一致，可直接搬运
    f[2] = 1;//即f(2) = 1
    for(int i = 3;i <= n;i++)//for循环，从3到n
    {
        f[i] = f[i-1] + f[i-2];//即f(i) = f(i-1) + f(i-2)
    }
    cout << f[n] << endl;//输出f(n)
    return 0;
}
//数组的好处是，可以避免重复计算，提高效率
//例如，计算f(5)时，需要计算f(4)和f(3)，如果用数组存储f[i]，则直接从数组中取出f(4)和f(3)，避免重复计算
//如果不用数组存储f[i]，则需要重复计算f(4)和f(3)，导致效率低
//所以，用数组存储f[i]，可以避免重复计算，提高效率