#include<stdio.h>
int main()
{
    int i = 123,m = 65;//整数变量i和m的值分别为123和65
    char ch = 'a';//字符变量ch的值为字符'a'
    double d =12.3456;//双精度浮点数变量d的值为12.3456
    printf("a = %d,%o,%x\n",i,i,i);//输出a的十进制、八进制、十六进制表示
    printf("ch %c,%d\n",ch,ch);//输出ch的字符表示和ASCII码
    printf("m = %c,%d\n",m,m);//输出m的字符表示和ASCII码
    printf("%f,%6.2f,%e\n",d,d,d);//输出d的默认表示、宽度为6、小数点后保留2位的表示、科学计数法表示
    return 0;
}
//%d表示整数，%o表示八进制数，%x表示十六进制数
//%f表示浮点数，%6.2f表示宽度为6、小数点后保留2位的浮点数
//%e表示科学计数法表示，%f表示默认表示
//%c表示字符，%md表示宽度为m的字符，%u表示无符号整数
//%ld表示长整数，%lf表示双精度浮点数，%s表示字符串